# CurrentActiveView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewActivatingEventArgs..::..CurrentActiveView Property
ViewActivatingEventArgs Class See Also
---
The view that is currently active.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public View CurrentActiveView { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurrentActiveView As View
	Get
```

Visual C++
---
```text
public:
property View^ CurrentActiveView {
	View^ get ();
}
```

# Remarks
May be nullNothingnullptra null reference (Nothing in Visual Basic) if there is no currently active view.
# See Also
ViewActivatingEventArgs Class
Autodesk.Revit.UI.Events Namespace